; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v3)
             (pred_2 ?v11 ?v13)
             (pred_7 ?v6 ?v13)
             (pred_1 ?v12 ?v6 )
	     (pred_3 ?v6)
             (pred_12 ?v5)
             (pred_4 ?v11)
             (pred_5 ?v13)
             (pred_9 ?v6)
             (pred_11 ?v11)
             (pred_8 ?v6)
             (pred_6 ))



(:action op_5
:parameters (?v7 ?v8 ?v4 ?v2)
:precondition (and (pred_12 ?v7) (pred_12 ?v8) (pred_4 ?v4) (pred_5 ?v2)
          (pred_10 ?v7 ?v8) (pred_2 ?v4 ?v2)
                   (pred_7 ?v8 ?v2) (pred_3 ?v7) 
                   (pred_9 ?v8) (pred_11 ?v4))
:effect (and  (pred_8 ?v8) (not (pred_9 ?v8))))


(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_12 ?v7) (pred_12 ?v1)
               (pred_3 ?v7) (pred_10 ?v7 ?v1) (pred_8 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v7))))

(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_12 ?v7) (pred_4 ?v4) 
                  (pred_3 ?v7) (pred_1 ?v4 ?v7) (pred_6 ))
:effect (and (pred_11 ?v4)
   (not (pred_1 ?v4 ?v7)) (not (pred_6 ))))


(:action op_1
:parameters (?v7 ?v9 ?v10)
:precondition (and (pred_12 ?v7) (pred_4 ?v9) (pred_4 ?v10)
                  (pred_3 ?v7) (pred_11 ?v10) (pred_1 ?v9 ?v7))
:effect (and (pred_11 ?v9) (pred_1 ?v10 ?v7)
        (not (pred_11 ?v10)) (not (pred_1 ?v9 ?v7))))

(:action op_3
:parameters (?v7 ?v4)
:precondition (and (pred_12 ?v7) (pred_4 ?v4) 
                  (pred_3 ?v7) (pred_11 ?v4))
:effect (and (pred_6 ) (pred_1 ?v4 ?v7) (not (pred_11 ?v4)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_06 obj_02 obj_12 obj_01 obj_10 obj_11 obj_09 obj_08
    obj_07 obj_03
    obj_04 obj_13
    )

    (:init
       (pred_6)

       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_03)
       (pred_4 obj_04)
       (pred_4 obj_13)

       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_06 obj_01)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_01 obj_09)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_06)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_09)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_7  obj_09 obj_07)
       (pred_7  obj_08 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_06)
       (pred_8 obj_02)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_10)
       (pred_8 obj_11)

       (pred_2  obj_04 obj_07)
       (pred_2  obj_13 obj_03)
       (pred_1 obj_04 obj_08)
       (pred_1 obj_13 obj_11)
       (pred_3 obj_02)
    )

    (:goal (and
       (pred_1 obj_13 obj_08)
    ))
(:constraints
  (always (not (pred_3 obj_01)))
)
)

; plan
1. (op_2 obj_02 obj_06)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_06)
   goals met: 0 of 1
2. (op_2 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_05)
   goals met: 0 of 1
3. (op_2 obj_05 obj_12)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_12)
   goals met: 0 of 1
4. (op_2 obj_12 obj_11)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_11)
   goals met: 0 of 1
5. (op_4 obj_11 obj_13)
   deleted: (pred_1 obj_13 obj_11) (pred_6)
   added: (pred_11 obj_13)
   goals met: 0 of 1
6. (op_2 obj_11 obj_12)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_12)
   goals met: 0 of 1
7. (op_2 obj_12 obj_05)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_05)
   goals met: 0 of 1
8. (op_2 obj_05 obj_06)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_06)
   goals met: 0 of 1
9. (op_2 obj_06 obj_02)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_02)
   goals met: 0 of 1
10. (op_2 obj_02 obj_10)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_10)
   goals met: 0 of 1
11. (op_5 obj_10 obj_08 obj_13 obj_03)
   deleted: (pred_9 obj_08)
   added: (pred_8 obj_08)
   goals met: 0 of 1
12. (op_2 obj_10 obj_08)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_08)
   goals met: 0 of 1
13. (op_1 obj_08 obj_04 obj_13)
   deleted: (pred_11 obj_13) (pred_1 obj_04 obj_08)
   added: (pred_11 obj_04) (pred_1 obj_13 obj_08)
   goals met: 1 of 1
